## Staging: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 17 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                      |
|--------|-------------------------------------------------------------------------------|
| add    | `aws_ecr_repository.github_arc_runner`                                        |
|        | `aws_secretsmanager_secret.api_lambda_repository_url`                         |
|        | `aws_secretsmanager_secret.github_arc_runner_repository_url`                  |
|        | `aws_secretsmanager_secret.google_cidr_repository_url`                        |
|        | `aws_secretsmanager_secret.heartbeat_repository_url`                          |
|        | `aws_secretsmanager_secret.ses_receiving_emails_repository_url`               |
|        | `aws_secretsmanager_secret.ses_to_sqs_email_callbacks_repository_url`         |
|        | `aws_secretsmanager_secret.sns_to_sqs_sms_callbacks_repository_url`           |
|        | `aws_secretsmanager_secret.system_status_repository_url`                      |
|        | `aws_secretsmanager_secret_version.api_lambda_repository_url`                 |
|        | `aws_secretsmanager_secret_version.github_arc_runner_repository_url`          |
|        | `aws_secretsmanager_secret_version.google_cidr_repository_url`                |
|        | `aws_secretsmanager_secret_version.heartbeat_repository_url`                  |
|        | `aws_secretsmanager_secret_version.ses_receiving_emails_repository_url`       |
|        | `aws_secretsmanager_secret_version.ses_to_sqs_email_callbacks_repository_url` |
|        | `aws_secretsmanager_secret_version.sns_to_sqs_sms_callbacks_repository_url`   |
|        | `aws_secretsmanager_secret_version.system_status_repository_url`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.github_arc_runner will be created
  + resource "aws_ecr_repository" "github_arc_runner" {
      + arn                  = (known after apply)
      + force_delete         = false
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/github_arc_runner"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_secretsmanager_secret.api_lambda_repository_url will be created
  + resource "aws_secretsmanager_secret" "api_lambda_repository_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "API_LAMBDA_REPOSITORY_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.github_arc_runner_repository_url will be created
  + resource "aws_secretsmanager_secret" "github_arc_runner_repository_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "GITHUB_ARC_RUNNER_REPOSITORY_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.google_cidr_repository_url will be created
  + resource "aws_secretsmanager_secret" "google_cidr_repository_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "GOOGLE_CIDR_REPOSITORY_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.heartbeat_repository_url will be created
  + resource "aws_secretsmanager_secret" "heartbeat_repository_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "HEARTBEAT_REPOSITORY_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.ses_receiving_emails_repository_url will be created
  + resource "aws_secretsmanager_secret" "ses_receiving_emails_repository_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "SES_RECEIVING_EMAILS_REPOSITORY_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.ses_to_sqs_email_callbacks_repository_url will be created
  + resource "aws_secretsmanager_secret" "ses_to_sqs_email_callbacks_repository_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "SES_TO_SQS_EMAIL_CALLBACKS_REPOSITORY_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.sns_to_sqs_sms_callbacks_repository_url will be created
  + resource "aws_secretsmanager_secret" "sns_to_sqs_sms_callbacks_repository_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "SNS_TO_SQS_SMS_CALLBACKS_REPOSITORY_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.system_status_repository_url will be created
  + resource "aws_secretsmanager_secret" "system_status_repository_url" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "SYSTEM_STATUS_REPOSITORY_URL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.api_lambda_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "api_lambda_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.github_arc_runner_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "github_arc_runner_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.google_cidr_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "google_cidr_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.heartbeat_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "heartbeat_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.ses_receiving_emails_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "ses_receiving_emails_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.ses_to_sqs_email_callbacks_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "ses_to_sqs_email_callbacks_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.sns_to_sqs_sms_callbacks_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "sns_to_sqs_sms_callbacks_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.system_status_repository_url will be created
  + resource "aws_secretsmanager_secret_version" "system_status_repository_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_arc_runner_ecr_arn                     = (known after apply)
  + github_arc_runner_repository_url              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.github_arc_runner"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.google-cidr"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.heartbeat"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.notify_admin[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.performance-test[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ses_to_sqs_email_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sns_to_sqs_sms_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.system_status"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.api_lambda_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.github_arc_runner_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.google_cidr_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.heartbeat_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ses_receiving_emails_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ses_to_sqs_email_callbacks_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.sns_to_sqs_sms_callbacks_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.system_status_repository_url"]

37 tests, 19 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
